Applying **uat**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # module.cloud_bucket["learn-gcpdevops-98765"].google_storage_bucket.bucket will be destroyed
  # (because module.cloud_bucket["learn-gcpdevops-98765"] is not in configuration)
-   resource "google_storage_bucket" "bucket" {
-       default_event_based_hold    = false -> null
-       force_destroy               = true -> null
-       id                          = "learn-gcpdevops-98765" -> null
-       labels                      = {
-           "app" = "gcs"
-           "env" = "uat"
        } -> null
-       location                    = "ASIA-SOUTH1" -> null
-       name                        = "learn-gcpdevops-98765" -> null
-       project                     = "learn-gcp-devops-adarsh" -> null
-       public_access_prevention    = "inherited" -> null
-       requester_pays              = false -> null
-       self_link                   = "https://www.googleapis.com/storage/v1/b/learn-gcpdevops-98765" -> null
-       storage_class               = "STANDARD" -> null
-       uniform_bucket_level_access = true -> null
-       url                         = "gs://learn-gcpdevops-98765" -> null

-       encryption {
-           default_kms_key_name = "projects/learn-gcp-devops-adarsh/locations/asia-south1/keyRings/sample-keyring/cryptoKeys/test" -> null
        }

-       lifecycle_rule {
-           action {
-               type = "Delete" -> null
            }
-           condition {
-               age                        = 3 -> null
-               days_since_custom_time     = 0 -> null
-               days_since_noncurrent_time = 0 -> null
-               matches_prefix             = [] -> null
-               matches_storage_class      = [] -> null
-               matches_suffix             = [] -> null
-               num_newer_versions         = 0 -> null
-               with_state                 = "ANY" -> null
            }
        }

-       logging {
-           log_bucket        = "log-bucket" -> null
-           log_object_prefix = "learn-gcpdevops-98765" -> null
        }

-       versioning {
-           enabled = true -> null
        }
    }

  # module.cloud_bucket["learn-gcpdevops-987654"].google_storage_bucket.bucket will be created
+   resource "google_storage_bucket" "bucket" {
+       force_destroy               = true
+       id                          = (known after apply)
+       labels                      = {
+           "app" = "gcs"
+           "env" = "uat"
        }
+       location                    = "ASIA-SOUTH1"
+       name                        = "learn-gcpdevops-987654"
+       project                     = "learn-gcp-devops-adarsh"
+       public_access_prevention    = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       encryption {
+           default_kms_key_name = "projects/learn-gcp-devops-adarsh/locations/asia-south1/keyRings/sample-keyring/cryptoKeys/test"
        }

+       lifecycle_rule {
+           action {
+               type = "Delete"
            }
+           condition {
+               age                   = 3
+               matches_prefix        = []
+               matches_storage_class = []
+               matches_suffix        = []
+               with_state            = (known after apply)
            }
        }

+       logging {
+           log_bucket        = "log-bucket"
+           log_object_prefix = (known after apply)
        }

+       versioning {
+           enabled = true
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ bucket_id        = [
-       "learn-gcpdevops-98765",
+       null,
    ]
  ~ bucket_name      = [
-       "learn-gcpdevops-98765",
+       "learn-gcpdevops-987654",
    ]
  ~ bucket_self_link = [
-       "https://www.googleapis.com/storage/v1/b/learn-gcpdevops-98765",
+       null,
    ]
  ~ bucket_url       = [
-       "gs://learn-gcpdevops-98765",
+       null,
    ]
```

```
module.cloud_bucket["learn-gcpdevops-98765"].google_storage_bucket.bucket: Destroying... [id=learn-gcpdevops-98765]
module.cloud_bucket["learn-gcpdevops-987654"].google_storage_bucket.bucket: Creating...
module.cloud_bucket["learn-gcpdevops-98765"].google_storage_bucket.bucket: Destruction complete after 2s
module.cloud_bucket["learn-gcpdevops-987654"].google_storage_bucket.bucket: Creation complete after 3s [id=learn-gcpdevops-987654]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

Outputs:

bucket_id = [
  "learn-gcpdevops-987654",
]
bucket_name = [
  "learn-gcpdevops-987654",
]
bucket_self_link = [
  "https://www.googleapis.com/storage/v1/b/learn-gcpdevops-987654",
]
bucket_url = [
  "gs://learn-gcpdevops-987654",
]

```